x = {
    'story': (243, 522, 400, 560),  # 故事
    'menu': (107, 9, 162, 36),  # 主线故事
    'menu1': (107, 9, 162, 36),  # 主线故事
    'menu2': (107, 9, 162, 36),  # 主线故事
    'go-main-story': (70, 100, 196, 120),  # 最终章(前往主线剧情)
    'choose-plot': (107, 9, 162, 36),
    'clearance': (861, 188, 983, 205),
    'current-clearance': (855, 188, 1010, 205),
    'first-lock': (1102, 225, 1131, 257),
    'plot-info': (577, 145, 640, 174),
    'plot-fight': (378, 270, 400, 293),
    'plot-attack': (107, 9, 162, 36),  # 部队出击
    'join-chapter': (580, 500, 703, 530),  # 进入章节
    'fight-parse': (1223, 32, 1243, 59),  # 战斗中暂停按钮
    'fight-confirm': (1144, 649, 1194, 674),  # 战斗结果
    'fight-fail': (609, 642, 670, 668),  # 战斗失败
    'auto': (1181, 664, 1236, 689),  # 自动战斗
    'three-times': (1190, 616, 1240, 633),  # 三倍加速
    'main-lv-start-task': (872, 522, 938, 550),  # 主线关卡开始任务
    'side-lv-start-task': (574, 497, 638, 524),  # 支线关卡开始任务
    'get-prize': (611, 265, 671, 288),  # 获得剧情奖励
}
